## Observations

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df =pd.read_csv(r"C:\Users\V.MANOHAR\OneDrive\Documents\Manu\Notes\data\temp\aspiring_minds_employability_outcomes_2015.csv")
df.head()

,Unnamed: 0,ID,Salary,DOJ,DOL,Designation,JobCity,Gender,DOB,10percentage,...,ComputerScience,MechanicalEngg,ElectricalEngg,TelecomEngg,CivilEngg,conscientiousness,agreeableness,extraversion,nueroticism,openess_to_experience
0,train,203097,420000,01-06-2012 00:00,present,senior quality engineer,Bangalore,f,19-02-1990 00:00,84.3,...,-1,-1,-1,-1,-1,0.9737,0.8128,0.5269,1.35490,-0.4455
1,train,579905,500000,01-09-2013 00:00,present,assistant manager,Indore,m,04-10-1989 00:00,85.4,...,-1,-1,-1,-1,-1,-0.7335,0.3789,1.2396,-0.10760,0.8637
2,train,810601,325000,01-06-2014 00:00,present,systems engineer,Chennai,f,03-08-1992 00:00,85.0,...,-1,-1,-1,-1,-1,0.2718,1.7109,0.1637,-0.86820,0.6721
3,train,267447,1100000,01-07-2011 00:00,present,senior software engineer,Gurgaon,m,05-12-1989 00:00,85.6,...,-1,-1,-1,-1,-1,0.0464,0.3448,-0.3440,-0.40780,-0.9194
4,train,343523,200000,01-03-2014 00:00,01-03-2015 00:00,get,Manesar,m,27-02-1991 00:00,78.0,...,-1,-1,-1,-1,-1,-0.8810,-0.2793,-1.0697,0.09163,-0.1295

In [14]:
df.Salary.max()

4000000

#### Highest Salary is 40,00,000

In [12]:
df.loc[(df.Salary==4000000)]

,Unnamed: 0,ID,Salary,DOJ,DOL,Designation,JobCity,Gender,DOB,10percentage,...,ComputerScience,MechanicalEngg,ElectricalEngg,TelecomEngg,CivilEngg,conscientiousness,agreeableness,extraversion,nueroticism,openess_to_experience
1237,train,48107,4000000,01-07-2010 00:00,01-03-2015 00:00,senior software engineer,New Delhi,m,09-09-1987 00:00,90.83,...,-1,-1,-1,-1,-1,-0.7264,0.0328,-1.6502,-0.8778,-0.1295
2182,train,41147,4000000,01-01-2010 00:00,01-12-2011 00:00,automation engineer,gurgaon,m,13-09-1987 00:00,53.00,...,-1,-1,-1,-1,-1,-3.3539,-0.4353,-1.0697,-0.0552,-2.6572

#### 2 members having Highest (40,00,000) salary

In [15]:
df[['Salary','Gender']].max()

Salary    4000000
Gender          m
dtype: object

####  Male has the highest salary

In [30]:
df.Salary.min()

35000

#### 35000 is the least salary

In [29]:
df[['Salary','Gender']].min()

Salary    35000
Gender        f
dtype: object

#### Female has the least salary

In [27]:
df[['10percentage','Gender']].max()

10percentage    97.76
Gender              m
dtype: object

#### Male has highest percentage in 10th

In [28]:
df[['10percentage','Gender']].min()

10percentage    43
Gender           f
dtype: object

#### Female has the less percentage in 10th

In [52]:
df[['12percentage','Gender']].max()

12percentage    98.7
Gender             m
dtype: object

#### Male has highest percentage in 12th

In [53]:
df[['12percentage','Gender']].min()

12percentage    40
Gender           f
dtype: object

#### Female has least percentage in 12th

In [51]:
pd.crosstab(index=df['CollegeState'],columns='Total no.of Students')

col_0              Total no.of Students
CollegeState
Andhra Pradesh                      225
Assam                                 5
Bihar                                10
Chhattisgarh                         27
Delhi                               162
Goa                                   1
Gujarat                              24
Haryana                             180
Himachal Pradesh                     16
Jammu and Kashmir                     7
Jharkhand                            28
Karnataka                           370
Kerala                               33
Madhya Pradesh                      189
Maharashtra                         262
Meghalaya                             2
Orissa                              172
Punjab                              193
Rajasthan                           174
Sikkim                                3
Tamil Nadu                          367
Telangana                           319
Union Territory                       5
Uttar Pradesh                       915
Uttarakhand                         113
West Bengal                         196

#### Finding total number of Students in different states

In [4]:
df.groupby('Gender')[['Salary']].sum()

           Salary
Gender
f       282255000
m       947929000

#### On the basis of Total salary. Male earning more than female

In [6]:
pd.crosstab([df.Gender],[df.Salary],margins=True)

Salary,35000,40000,45000,50000,55000,60000,65000,70000,75000,80000,...,2000000,2020000,2050000,2300000,2500000,2600000,3000000,3500000,4000000,All
Gender,,,,,,,,,,,,,,,,,,,,,
f,1,0,1,3,0,3,2,2,1,2,...,0,0,0,0,0,0,0,1,0,957
m,2,2,3,2,1,10,2,5,5,9,...,4,1,1,1,1,1,1,0,2,3041
All,3,2,4,5,1,13,4,7,6,11,...,4,1,1,1,1,1,1,1,2,3998

#### Students in different Salary sections